{
    "update": [
        {
            "version": "1.0.3",
            "flashyTitle": "",
            "features": [
                "Made the Add div tool work again."
            ],
            "short": "Question Bank Div Adder fix"
        },
        {
            "version": "1.0.2",
            "flashyTitle": "",
            "features": [
                "Made the Add div tool faster (hopefully)",
                "Checks which questions need to be changed before updating them",
                "Checks if there's a faster way to update the questions, and does that way if it is there"
            ],
            "short": "Question Bank div adder improvement"
        },
        {
            "version": "1.0.0",
            "flashyTitle": "Total Revamp",
            "features": [
                "Update the layout of the options page",
                "Automatically open options page on both install and updates",
                "Adds both general and specific information about the updates",
                "Make the creation of pages more dynamic, making development easier",
                "Add a place for feedback",
                "A link to the options page in the popup"
            ],
            "short": "Total UI overhaul"
        },
        {
            "version": "0.8.1",
            "flashyTitle": "",
            "features": [
                "Fixed a bug that was slowing down Canvas dramatically. The extension would try to find crosslisted courses on incorrect pages, and it would do so in a seemingly infinite loop."
            ],
            "short": "Emergency bug fix"
        },
        {
            "version": "0.8.0",
            "flashyTitle": "",
            "features": [
                "Added feature to remove all quizzes",
                "Select all files button",
                "Change how the options page is created to be more dynamic"
            ],
            "short": "Remove all Quizzes and other similar tools"
        }
    ],
    "details": [
        {
            "id": "sectionsColumn",
            "title": "Display Sections Column",
            "description": "This will display a new column listing the sections for each course on the right side of the search results. If a section was cross - listed into the course, it is highlighted in blue. Blueprint courses display as 'BP', Reference courses as 'REF', and courses that do not have sections but have a long title, are shortened to five letters.",
            "type": "display"
        },
        {
            "id": "sectionsBreadcrumb",
            "title": "Display Sections in Breadcrumb",
            "description": "This will display the sections for the course in the breadcrumb after the course name. If a section was cross-listed into the course, it is highlighted in blue. Blueprint courses display as 'BP', Reference courses as 'REF', and courses that do not have sections but have a long title, are shortened to five letters.",
            "type": "display"
        },
        {
            "id": "navToModules",
            "title": "Show Module Navbar",
            "description": "This will display the navbar on the modules page. All of the week/lesson modules have been shortened to \"W\" followed by the week/lesson.",
            "type": "display"
        },
        {
            "id": "addBlueprintParent",
            "title": "Link to Blueprint Parent Account",
            "description": "This will add a link to the modules navbar at the bottom of the page that links to the parent blueprint.If there is no blueprint for the course nothing will show up there. Operates seperate of the module navbar, so it will show up with or without the navbar option being selected.",
            "type": "display"
        },
        {
            "id": "deleteQuizQuestions",
            "title": "Delete all Quiz Questions",
            "description": "Show the option to delete all quiz questions in the extension popup. When you click the button it will confirm if you want to delete <em>All</em> of the quiz questions.It will not confirm for each individual question.",
            "type": "popup"
        },
        {
            "id": "blueprintLockItems",
            "title": "Lock/Unlock blueprint items",
            "description": "Show the option to lock and unlock blueprint items in the extension popup.",
            "type": "popup"
        },
        {
            "id": "divsToQuestions",
            "title": "Add Divs to Quiz Questions",
            "description": "Show the option to add Divs on quiz questions in the extension popup. This feature takes a little bit to run, but it\"s a lot faster than doing them individually.If you\"re looking at the console, you will see a lot of errors, but those are because the tool is running too fast for the page to load completely.",
            "type": "popup"
        },
        {
            "id": "adminAccountNames",
            "title": "Display Sub-accounts",
            "description": "This option will show the sub-account of courses in the Admin view. Will only display a sub-account if it\"s different than the previously displayed value.",
            "type": "display"
        },
        {
            "id": "blueprintAssociations",
            "title": "Link Associated Blueprint Courses",
            "description": "When you go to the associated courses tab in a blueprint course, this will make each course title a link to the correct course.",
            "type": "display"
        },
        {
            "id": "selectAllFiles",
            "title": "Select All Files Button",
            "description": "Displays the 'select all' button when working with files.",
            "type": "display"
        },
        {
            "id": "killQuizzes",
            "title": "Deletes All Quizzes",
            "description": "Deletes all the quizzes in the Quizzes section.",
            "type": "popup"
        }
    ],
    "install": [
        {
            "name": "popup",
            "internals": "<p class='install-info'>The tools under this label will only run when you click the button in the popup. The button will only appear if the option below is selected. These tools primarily automate tasks. They turn several button clicks into just a few.</p>",
            "selector": "div#popup",
            "before": "div#popup div"
        },
        {
            "name": "display",
            "internals": "<p class='install-info'>The tools under the Displays label will run automatically on the correct pages. The purpose of these tools is to make navigation easier. There are a couple that do things when clicked, but most of them are for navigation.</p>",
            "selector": "div#display",
            "before": "div#display div"
        }
    ]
}